var Privacy = `
## 1. 개인정보취급방침을 공유하는 이유
당사는 News Keeper가 어떤 데이터를 수집하고 수집한 데이터를 어떻게 사용하는지에 대해 귀하가 항상 숙지하고 이 모두에 대해 실질적인 통제력을 가져야 한다고 생각합니다. 당사는 귀하가 당사와 공유하는 정보에 대해 최선의 결정을 내릴 수 있도록 권한을 부여하고자 합니다.

## 2. 당사와 공유하는 정보

당사는 귀하에 대한 서비스 제공을 위해 특정 정보를 필요로 합니다. 예를 들어, 귀하가 News Keeper에 콘텐츠를 공유하려면 계정이 있어야 합니다. 귀하가 아래 정보를 당사와 공유하기로 선택하면 당사는 당사의 서비스 운영을 위해 이를 수집, 이용합니다.

> **기본 계정정보**
   
   News Keeper에서 다른 이용자가 공유한 스크랩을 확인하는 등 일부 서비스 기능의 이용을 위해서는 계정을 만들 필요가 없습니다. 
   
   **회원가입은 구글 또는 카카오같은 소셜 인증업체를 통해 얻은 정보로만 진행됩니다.** 귀하는 소셜 인증업체에 등록된 자신의 **고유번호, 이름, 프로필 사진** 정보를 제공해야 합니다.

   News Keeper에 등록된 귀하의 정보는 로그인할 때마다 인증업체와 동기화됩니다.

   귀하의 이름과 사진은 항상 공개되지만, 이용자는 실명이나 가명을 사용할 수 있습니다.

> **공개 정보**

   귀하가 News Keeper에 회원가입할 때 제공한 정보중 이름, 사진이 다른 이용자에게 공개됩니다.
   
   귀하가 News Keeper에서 설정한 채널 소개 텍스트가 다른 이용자에게 공개됩니다.
   
   귀하가 News Keeper에서 직접 공유를 설정한 특정 인터넷 페이지에 대한 텍스트(스크랩)가 다른 이용자에게 공개됩니다. 스크랩을 저장할 때, 또는 스크랩 상세 페이지에서 "공유" 버튼을 활성화(파란색 배경 표시)시킴으로써 공유할 수 있습니다. 이 경우 귀하가 직접 설정한 카테고리와 해당 인터넷 페이지의 메타 태그에서 추출한 페이지의 제목, 요약 내용, 대표 이미지를 포함한 직접 링크가 함께 공유됩니다.
   
   귀하가 다른 이용자가 공유한 텍스트에 대한 활동(예: 좋아요/싫어요, 댓글)이 공유됩니다.

> **쪽지 및 비공개 소통**
   
   당사는 귀하가 조금 더 개인적으로 소통하거나 누가 귀하의 콘텐츠를 볼지를 통제할 수 있게 해주는 특정 기능을 제공합니다. 예를 들어, News Keeper에서 비공개 대화를 나누기 위해 쪽지 기능을 사용할 수 있습니다. 귀하가 쪽지를 보내거나 받음으로써 다른 사람들과 소통할 때, 당사는 귀하의 소통 내용 및 관련 정보를 저장하고 처리합니다.
   
   당사는 귀하의 쪽지 내용을 해당 쪽지의 수신자와 공유하며, 귀하에게 광고를 게재하는데 쪽지를 사용하지 않습니다. 

   쪽지와 같은 기능을 사용하여 소통하는 경우, 귀하가 자신의 계정에서 이러한 쪽지 사본을 삭제하더라도 수신자의 News Keeper에 귀하의 소통 내용의 사본을 보유하고, 따라서 해당 내용이 복제, 보관되거나 다시 공유될 수 있음을 잊지 마십시오.

> **당사와 공유하는 정보에 대한 통제 방법**
   
   귀하는 다음 사항을 결정할 수 있습니다.

   * 특정 인터넷 페이지에 대한 텍스트를 다른 이용자에게 공개할 것인지 여부
   * 다른 이용자에게 공개되는 채널 소개 텍스트
   
   귀하는 구글, 카카오 등 소셜 인증업체를 통해 다음 정보를 변경할 수 있습니다. 변경된 정보는 다시 로그인했을 때 인증업체와 동기화됩니다.
   
   * 이름
   * 사진

## 3. 당사가 수령하는 귀하에 관한 추가 정보

당사는 귀하가 당사의 서비스 또는 당사의 콘텐츠가 포함된 기타 웹사이트 또는 모바일 앱을 사용할 때 광고주를 포함한 제3자로부터 특정 정보를 수집합니다. 귀하가 당사와 공유하는 정보와 마찬가지로, 당사는 아래의 데이터를 사용하여 서비스를 운영합니다.

> **키워드**

귀하가 **저장하거나 좋아요 또는 싫어요를 표시한 스크랩**에서 해당 스크랩과 연결된 특정 인터넷 페이지의 메타 데이터에서 추출한 **페이지의 제목, 내용 요약에서 추출한 키워드**가 귀하에게 가장 적합한 **광고를 게재하는데 사용됩니다.**

키워드 정보는 당사의 서비스에서 광고를 담당하는 제3의 서비스 업체와 공유될 수 있습니다. 대표적인 예로 '구글 애드몹'이 있습니다.

**귀하가 스크랩을 저장할 때 입력한 텍스트는 포함되지 않습니다.**
   
## 4. 당사가 공유하고 공개하는 정보
   
위에서 언급한 바와 같이, News Keeper는 귀하가 당사의 서비스를 통해 공개적으로 공유하는 정보를 광범위하고 즉각적으로 유통시키도록 설계되었습니다. 당사가 귀하의 사적인 개인 데이터를 공개하는 일부의 경우, 당사는 귀하의 통제 하에 공개를 실행합니다. 그렇게 하는 것이 당사의 서비스 운영을 위해서 중요하거나 법으로 요구되기 때문입니다.

> **스크랩**
   
귀하가 공유한 스크랩은 서버에 업로드되고, 다른 이용자들이 해당 스크랩을 확인할 수 있습니다.

> **키워드**

귀하가 **저장하거나 좋아요 또는 싫어요를 표시한 스크랩**에서 해당 스크랩과 연결된 특정 인터넷 페이지의 메타 데이터에서 추출한 **페이지의 제목, 내용 요약에서 추출한 키워드**가 News Keeper의 광고를 처리하는 **'구글 애드몹'에 전달됩니다.** 키워드는 '구글 애드몹'에서 귀하에게 가장 적합한 **광고를 게재하는데 사용됩니다.**

**귀하가 스크랩을 저장할 때 입력한 텍스트는 포함되지 않습니다.**

> **법, 손해 및 공익**
   
본 개인정보처리방침 또는 당사가 귀하에게 다른 방식으로 제공할 수 있는 통제와 상반되는 내용이 있을지라도, 당사는 법, 규정, 법적 절차 또는 정부 요청에 따르기 위해, 개인의 안전을 보호하기 위해, 당사의 플랫폼의 안전 또는 무결성을 보호하기 위해(당사의 서비스에서 스팸, 악용 또는 악의적인 행위자를 방지하는 것을 지원하고, 당사의 서비스에서 콘텐츠 또는 계정을 삭제한 이유를 설명하기 위한 경우 포함8, 사기, 보안 또는 기술적 문제를 해결하기 위해, 또는 당사의 권리 또는 재산 또는 당사의 서비스 이용자의 권리 또는 재산을 보호하기 위해 합리적으로 필요하다고 판단된다면, 귀하의 개인 정보 및 기타 안전 관련 정보를 보존, 사용, 공유하거나 공개할 수 있습니다.

> **계열사 및 소유권 변경**
   
당사가 파산, 합병, 인수, 구조 조정 또는 자산매각에 관련될 경우 귀하의 개인 데이터는 해당 거래의 일환으로 매각 또는 양도될 수 있습니다. 본 개인정보처리방침은 새로운 사업체에 이전되는 귀하의 개인 데이터에 적용됩니다. 또한 당사는 광고 게재를 포함하여 당사의 서비스와 계열사의 서비스의 운영 지원을 위해 귀하에 관한 정보를 당사의 법인 계열사에게 공개할 수 있습니다.

## 5. 당사와 함께 귀하의 개인 정보 관리하기
   
귀하는 당사와 공유하는 개인 데이터를 통제합니다. 귀하는 이러한 데이터에 언제든지 접근하거나 정정할 수 있습니다. 귀하의 계정을 비활성화할 수도 있습니다. 당사는 또한 귀하가 News Keeper에 제공한 데이터의 사용에 대해 일정한 경우 귀하에게 이의를 제기하거나, 제한하거나, 동의를 철회할 수 있는 도구를 제공합니다. 또한 당사는 귀하가 당사의 서비스를 통해 공유한 데이터를 이동할 수 있게 하고, 당사에 쉽게 접촉할 수 있는 방법을 제공합니다. 귀하의 프라이버시를 보호하고 보안을 유지하기 위해, 당사는 귀하에게 귀하의 개인정보에 대한 접근을 허용하거나 귀하의 개인정보 삭제, 이동 및 기타 관련 요청에 응하기에 앞서 귀하의 신원을 확인하기 위한 절차들을 따르고 있습니다.
   
> **스크랩 공유 및 공유 해제**
   
귀하가 스크랩을 저장할 때 또는 스크랩 상세 페이지에서 "공유" 버튼을 활성화(파란색 배경 표시) 시키면, 해당 스크랩이 서버에 업로드되면서 다른 이용자들이 해당 스크랩을 확인할 수 있습니다. 해당 스크랩이 서버에 업로드되면, 스크랩 리스트에서 해당 스크랩의 카테고리 배경색이 파란색으로 변경됩니다.

귀하가 스크랩을 저장할 때 "공유" 버튼을 비활성화(회색 배경 표시) 시키면, 해당 스크랩은 귀하의 단말기에만 저장되고, 다른 이용자들은 해당 스크랩을 확인할 수 없습니다.

귀하가 스크랩을 상세 페이지에서 "공유" 버튼을 비활성화(회색 배경 표시) 시키면, 해당 스크랩이 서버에서 삭제되면서 다른 이용자들이 해당 스크랩을 더 이상 확인할 수 없게 됩니다. 이 경우 스크랩 리스트에서 해당 스크랩의 카테고리의 배경색이 파란색에서 회식으로 변경됩니다. 만약 변경되지 않는다면, 서버에서 삭제되지 않은 경우이므로 계속해서 이러한 문제가 발생한다면 "프로필 > 문의하기"를 통해서 News Keeper 관리자에게 삭제를 요청해 주십시오.

**단, 법률의 요청이 있는 경우 당사는 서버에 업로드된 스크랩의 사본을 저장할 수 있습니다.**

> **개인정보 변경**

News Keeper는 구글 또는 카카오 등 인증업체에 등록된 귀하의 고유번호, 이름, 이메일, 사진 정보만을 통해서 회원가입을 진행하며, 추가 정보는 받지 않습니다. 따라서 해당 정보를 변경하기 위해서는 해당 인증업체에서 정한 방식으로 변경해야 하며, 변경된 정보는 다시 로그인할 때 동기화됩니다. 
   
채널 소개 텍스트는 프로필에서 "채널을 소개해 보세요"(채널 소개 텍스트가 없는 경우) 또는 기존의 채널 소개 텍스트를 터치하여 변경할 수 있습니다.
   
> **회원 탈퇴**

프로필에서 회원 탈퇴 버튼을 터치하여 회원탈퇴를 할 수 있습니다.
   
회원 탈퇴를 하면 귀하의 계정이 비활성화되고, 당사는 서버에 업로드된 귀하의 데이터를 최장 3일 동안 보관합니다. 
   
3일 이내 서버에 업로드된 귀하의 모든 정보가 자동으로 삭제됩니다. 비활성화된 회원의 정보는 언제든지 삭제될 수 있으며, 3일 동안의 회원 정보 보존을 보장하지 않습니다.
   
**단, 아직 삭제되지 않은 회원 정보는 법률의 요청이 있는 경우 3일 이상 보관할 수 있습니다.**

> **단말기에만 저장된 모든 정보 삭제**

프로필에서 "데이터 삭제" 버튼을 터치하여 공유 상태인 스크랩을 제외한 모든 데이터를 삭제할 수 있습니다.
   
**해당 방법으로 공유 상태인 스크랩은 삭제할 수 없습니다.**

## 6. 본 개인정보처리방침의 개정

당사는 본 개인정보처리방침을 수시로 개정할 수 있습니다. 본 방침의 최신 버전이 당사에 의한 귀하의 개인 데이터 처리에 적용되며 동 방침은 https://news-keeper.joon-lab.com/privacy_us.html 또는 최신 버전의 News Keeper 어플리케이션에 항상 게시됩니다. 귀하는 개정된 본 방침이 시행된 후 당사의 서비스에 계속 액세스하거나 이를 이용함으로써 개정된 개인정보처리방침에 구속되는 것에 동의하게 됩니다.

공지 일자: 2020년 11월 23일
적용 일자: 2020년 11월 23일
`