var TemrsOfUse = `
**News Keeper에 오신 것을 환영합니다!**
   
News Keeper은 사람들이 서로 교류하고 커뮤니티를 만들며 비즈니스를 성장시킬 수 있는 기술과 서비스를 개발합니다. (본 약관이 아닌) 별도의 약관이 적용된다고 명시되어 있지 않은 한, 본 약관은 이용자의 News Keeper이 제공하는 제품, 기능, 앱, 서비스, 기술, 소프트웨어(준랩 제품 또는 제품) 이용에 적용됩니다. 이러한 제품은 준랩이 제공합니다.
   
## 1. News Keeper가 제공하는 서비스
당사의 사명은 사람들이 쉽고 빠르게 자신의 생각을 기록하고, 커뮤니티를 통해 공유할 수 있는 능력을 주어 세계를 더욱 가까워지도록 만드는 것입니다. 당사는 이를 실현하기 위해 이용자에게 아래에 설명된 제품과 서비스를 제공합니다.
   
> **이용자가 특정 인터넷 페이지의 컨텐츠에 대한 자신의 생각을 쉽게 기록하고 확인할 수 있습니다.**
   
당사는 이용자가 이용하는 News Keeper 제품에서 이용자가 내부 브라우저에서 접속한 특정 페이지의 컨텐츠에 대한 간략한 정보와 직접 작성한 텍스트를 쉽게 작성하고 확인할 수 있도록 지원합니다. 이를 실현하기 위해 당사는 이용자가 텍스트를 작성하고 확인할 때, 현재 접속중이거나 해당 텍스트를 작성할 때 접속했던 이용자가 직접 입력한 카테고리, 인터넷 페이지의 주소, 해당 인터넷 페이지의 메타 태그에서 추출한 페이지의 제목, 요약 내용 및 대표 이미지를 포함한 정보(직접 링크)가 함께 공유합니다.

> **이용자에게 중요한 사람 및 단체와 연결합니다.**

당사는 이용자가 이용하는 News Keeper 제품에서 이용자가 작성한 텍스트를 직접 링크와 함께 다른 이용자에게 공유할 수 있고, 다른 이용자의 News Keeper에서의 활동(예: 좋아요/싫어요, 댓글)과 연결될 수 있도록 지원합니다.
   
당사는 이용자가 이용하는 News Keeper 제품에서 이용자에게 중요한 사람, 그룹, 비즈니스, 단체 및 다양한 다른 사항들을 찾고 연결할 수 있도록 지원합니다. 당사는 이용자와 다른 사람들에게 제안(예: 구독하거나 메시지를 보낼 페이지, 보고 싶은 프로그램 및 친구를 맺고 싶을 만한 사람 제안)하기 위해 당사가 보유한 데이터를 활용합니다. 더 친밀한 관계는 더 나은 커뮤니티를 만듭니다. **당사는 사람들이 본인이 관심 있는 사람, 그룹 및 단체와 연결될 때 News Keeper 서비스가 가장 가치 있다고 믿습니다.**

> **이용자가 자신을 표현하고 이용자가 중요하게 생각하는 것을 나눌 수 있는 기능을 제공합니다.**

News Keeper에서 이용자가 자신을 표현하고, 중요하게 생각하는 것을 친구와 가족, 다른 사람들과 나누기 위한 방법에는 여러 가지(예: 이용 중인 News Keeper 제품에서 사진, 스토리 공유, 친구 또는 여러 사람들에게 메시지 전송, 프로필에 콘텐츠 추가)가 있습니다.

> **이용자가 관심을 가질만한 콘텐츠, 제품 및 서비스를 찾을 수 있도록 지원합니다.**

News Keeper 제품을 이용 중인 많은 비즈니스와 단체가 제공하는 콘텐츠, 제품 및 서비스를 발견하는 데 도움이 되는 광고, 제안 및 기타 홍보 콘텐츠를 표시합니다.

> **유해 행위를 방지하고 커뮤니티를 보호 및 지원합니다.**

사람들은 자신이 안전하다고 느껴야만 News Keeper에서 커뮤니티를 형성합니다. 당사는 전 세계에 전담팀을 두고 최첨단 기술 시스템을 개발하여 당사 제품의 오용, 타인에 대한 유해 행위, 그리고 당사가 당사의 커뮤니티를 지원하거나 보호할 수 있는 상황을 감지합니다. 당사는 이러한 콘텐츠 또는 행위를 발견하는 경우, 적절한 조치(예: 도움 제공, 콘텐츠 삭제, 특정 기능에 대한 접근 삭제 또는 제한, 계정 비활성화 또는 사법당국에 연락)를 취할 것입니다.

> **전 세계 어디서나 당사의 서비스에 접속할 수 있도록 지원합니다.**

글로벌 서비스를 운영하기 위해, 이용자의 거주 국가 이외의 지역을 비롯하여 전 세계 데이터 센터 및 시스템에 콘텐츠와 데이터를 저장하고 배포해야 합니다. 이 인프라는 준랩 또는 그 계열사가 운영하거나 통제할 수 있습니다.

## 2. News Keeper 서비스가 자금 지원을 받는 방식

News Keeper은 이용자에게 News Keeper 또는 기타 본 약관이 적용되는 제품 및 서비스의 **사용료를 청구하지 않습니다.** 그 대신, **광고주가** 당사에게 그들의 제품 및 서비스 광고를 **이용자에게 보여드리도록 비용을 지불합니다.** News Keeper 제품을 사용함으로써 이용자는 당사가 이용자와 관련 있다고 생각되거나 이용자의 관심사와 관련이 있는 광고를 보여주는 것에 동의하게 됩니다. 당사는 **이용자가 입력한 텍스트를 제외**한 개인 데이터에서 추출한 **키워드를 사용하여** 이용자에게 보여드릴 **광고를 결정합니다.**

**개인 데이터는** 이용자가 News Keeper 내부 브라우저에서 **즐겨찾기에 추가하거나 스크랩한 인터넷 페이지의 주소, 해당 페이지의 메타 태그에서 추출한 제목, 내용 요약 및 이용자가 입력한 텍스트를 포함하는 정보입니다.**

## 3. News Keeper 서비스가 개인 정보를 보호하는 방식

**개인정보는** 개인 데이터와 구글 또는 카카오 등 소셜 인증업체로 부터 얻은 이용자의 **고유번호, 이름, 프로필 사진 및 로그인을 위한 암호화된 텍스트를 포함하는 정보입니다.**
   
News Keeper 개인정보 보호는 시스템을 설계할 때 핵심적으로 고려해온 사안입니다. 
   
이용자의 개인정보는 AWS 데이터베이스 서버에 저장되고, 해당 **데이터베이스 서버에는 이용자의 단말기와 통신하는 로직 서버 이외에는 접근할 수 없습니다.**
   
서버로 부터 이용자의 단말기로 수신된 이용자의 개인정보는 News Keeper **안드로이드 어플리케이션의 경우 키스토어에 저장**되며, News Keeper **iOS 어플리케이션의 경우 키체인에 저장**됩니다.
   
안드로이드의 키스토어와 iOS의 키체인 모두 강력한 보안 기능이 적용된 저장 공간입니다.
   
News Keeper 안드로이드 및 iOS 어플리케이션에는 **이용자의 조작없이 이용자의 개인 데이터를 서버에 업로드하는 로직이 포함되어 있지 않습니다.**
   
## 4. News Keeper 및 커뮤니티에 대한 약속

당사는 News Keeper의 사명을 실현하기 위해 이용자 및 다른 사람들에게 서비스를 제공합니다. 이에 대해 이용자는 다음과 같은 약속을 해야 합니다.

> News Keeper을 이용할 수 있는 사람
   
사람들이 각자의 의견과 행동에 대한 책임을 질 때 News Keeper 커뮤니티는 더 안전하고 신뢰할 수 있는 공간이 됩니다. 이러한 이유로 다음 사항을 준수해야 합니다.
   * 반드시 본인의 소셜 계정으로 로그인하고, 당사가 소셜 서버로 부터 이용자의 고유번호, 이름, 사진(개인정보)을 얻을 수 있는 토큰을 제공하고, 당사가 소셜 서버로 부터 개인정보를 얻는 것에 동의해야 합니다. 
   * 이용자의 News Keeper 계정에 대한 접근권한을 다른 사람에게 부여하거나, (당사의 허락 없이) 이용자의 계정을 타인에게 양도하지 않아야 합니다.
   
당사는 News Keeper이 널리 사용 가능하도록 노력하지만, 이용자가 다음에 해당한다면 News Keeper을 사용할 수 없습니다.
   * 이용자가 성범죄로 유죄 판결을 받은 경우
   * 이전에 당사의 약관이나 정책 위반하여 당사가 이용자의 계정을 비활성화한 경우
   * 관련 법률에 따라 이용자의 News Keeper 제품, 서비스 또는 소프트웨어 이용이 금지된 경우
   
> News Keeper에서 공유할 수 있는 것과 할 수 있는 행위
   
당사는 사람들이 자신을 표현하고 본인에게 중요한 콘텐츠를 공유하기 위해 News Keeper을 이용하되 이로 인해 다른 사람의 안전과 복지 또는 당사 커뮤니티의 무결성이 훼손되지 않기를 바랍니다. 따라서 귀하는 아래에 설명된 행위(또는 타인이 그러한 행위를 하는 것을 가능하게 하거나 지원하는 행위)에 관여하지 않는 데 동의합니다.
    
귀하는 다음의 행동을 하거나 이에 해당하는 사항을 공유하기 위해 당사 제품을 이용해서는 안 됩니다.
   * 귀하의 News Keeper 이용에 적용되는 본 약관과 커뮤니티 규정, 기타 약관 및 정책에 위반되는 행위
   * 불법 행위, 오해의 소지가 있는 행위, 차별적이거나 사기성 행위
   * 지적 재산권을 포함한 다른 사람의 권리를 침해하거나 위반하는 행위
   * 귀하는 바이러스 또는 악성 코드를 업로드할 수 없으며, 당사 제품의 적절한 작동이나 외관에 장애, 과부하 또는 손상을 가져올 수 있는 어떠한 행위도 해서는 안 됩니다.
   * 귀하는 (당사의 사전 허락 없이) 자동화된 수단을 사용하여 News Keeper 제품의 데이터에 접근하거나 이를 수집할 수 없고, 접근 권한이 없는 데이터에 접근하려고 시도해서는 안 됩니다.
   
당사는 위 조항들을 위반하는 콘텐츠에 대한 접근 권한을 삭제하거나 제한할 수 있습니다.
   
귀하가 커뮤니티 규정을 위반하여 공유한 콘텐츠를 당사가 삭제하는 경우, 당사는 귀하가 본 약관을 중대하게 또는 반복적으로 위반하거나, 귀하에게 재검토 요청을 선택하도록 하는 것이 당사 또는 제3자에게 법적 책임을 지우거나, 당사 사용자 커뮤니티에 해를 끼치는 경우 또는, 당사의 서비스, 시스템 또는 제품의 무결성이나 운영을 손상 또는 방해하거나, 아니면 기술적 한계로 인해 제한을 받거나 법적 이유로 금지되지 않는다면, 귀하에게 재검토를 요청하기 위한 모든 옵션을 알려드리고 설명합니다.
   
당사 커뮤니티를 위해 당사는 귀하의 권리(지적 재산권 포함)를 침해하거나 당사의 약관 및 정책에 위반된다고 생각되는 콘텐츠 또는 행위를 신고하는 것을 권장합니다.
   
News Keeper에 법적으로 불리하거나 규제에 영향을 끼치는 상황을 피하거나 줄이기 위해 귀하의 콘텐츠, 서비스 또는 정보를 삭제하거나 액세스를 제한할 필요가 있다고 판단되면 이를 시행합니다.

> 이용자가 당사에 부여한 권한
   
News Keeper 서비스를 제공하기 위해서는 이용자의 허락이 필요합니다:

1. 이용자가 생성 및 공유한 콘텐츠에 대한 권한

   사진이나 동영상 등 공유 또는 업로드하는 콘텐츠 중에는 지적 재산권법으로 보호되는 콘텐츠가 있을 수 있습니다.   

   이용자는 News Keeper 회사 제품에서 이용자가 만들고 공유하는 콘텐츠의 지적 재산권(저작권 또는 상표 등)을 소유합니다. 본 약관의 어느 조항도 자신의 콘텐츠에 대한 이용자의 권리를 박탈하지 않으며, 이용자는 원하는 곳 어디에서나 다른 사람들과 자유롭게 콘텐츠를 공유할 수 있습니다.

   이용자가 당사 제품에 또는 당사 제품과 관련하여 지적 재산권의 적용을 받는 콘텐츠를 공유, 게시 또는 업로드할 때, 이용자는 (이용자의 개인정보보호 및 앱 설정에 따라) 이용자의 콘텐츠를 호스팅, 이용, 배포, 수정, 실행, 복사, 공개적 이용 또는 표시, 번역 및 2차적 저작물 제작이 가능한 비독점적이고 양도 가능하며 재실시될 수 있고 로열티 없는 전 세계 통용 라이선스를 당사에 부여합니다. 이러한 라이선스는 당사 제품에 접속하고 이를 이용자 및 다른 사람들에게 당사 제품 이용을 가능하게 하기 위한 것입니다. 

   콘텐츠는 개별적으로 삭제하거나 계정을 삭제하여 한 번에 모두 삭제할 수 있습니다.

   삭제된 콘텐츠는 다른 사용자에게 더 이상 표시되지 않지만 당사 시스템의 다음과 같은 위치에 계속 존재할 수도 있습니다.
   * 기술적 제한으로 인해 즉시 삭제할 수 없는 위치(이 경우 콘텐츠는 이용자의 삭제 후 최대 90일 이내에 삭제됨)
   * 다른 사람이 이 라이선스에 따라 콘텐츠를 사용하였고 아직 삭제하지 않은 위치(이 경우 콘텐츠가 삭제될 때까지 이 라이선스가 계속 적용됨)
   * 또는 즉시 삭제할 경우 다음과 같은 조치가 제한되는 위치:
      * 불법 활동 또는 당사 약관 및 정책 위반 사항의 조사 또는 식별(예: 당사 제품 또는 시스템 오용 사례의 조사 또는 식별)
      * 증거 보존 등 법적 의무의 준수
      * 사법 또는 행정 당국, 법 집행 기관 또는 정부 기관의 요청 준수

   이 경우 콘텐츠는 콘텐츠가 유지된 목적에 필요한 기간만 유지됩니다(정확한 기간은 사례별로 다름).
   위의 각 경우 이 라이선스는 콘텐츠가 완전히 삭제될 때까지 유지됩니다.

2. 이용자가 입력한 텍스트를 제외한 개인 데이터 및 News Keeper에서의 활동(예: 좋아요/싫어요, 댓글)에 관한 정보를 당사 제품 전반에 보이는 광고, 제안 및 기타 스폰서 콘텐츠와 함께 또는 연관하여 표시할 수 있는 권한을 당사에 무상으로 부여합니다.
   
3. 이용자가 이용 또는 다운로드한 소프트웨어의 업데이트 권한: 이용자가 당사의 소프트웨어를 다운로드하거나 사용하면 가능한 경우 당사에 소프트웨어의 업데이트를 다운로드하고 설치할 수 있는 권한을 부여합니다.

4. News Keeper의 지적 재산 사용에 대한 제한

   이용자는 당사의 브랜드 사용 가이드라인이나 사전 서면 허락을 통해 명백하게 허락을 받은 경우에만 당사의 저작권 또는 상표(또는 비슷한 상표)를 사용할 수 있습니다. 이용자가 당사의 소스 코드를 수정하거나 소스 코드에 대한 파생물을 제작하거나 또는 소스 코드를 역컴파일하거나 기타 방법으로 소스 코드 추출을 시도하기 위해서는 당사의 서면 허락(또는 오픈 소스 라이선스에 의거한 허락)을 받아야 합니다.

## 5. 추가 조항
> **약관 업데이트**

당사는 사용자와 News Keeper 커뮤니티를 위해 더 나은 제품을 만들기 위해 지속적으로 서비스를 개선하고 새로운 기능을 개발하고 있습니다. 이에 따라 당사는 서비스 및 실무를 정확하게 반영하기 위해 본 약관을 수시로 업데이트해야 할 수 있습니다. 당사는 해당 조항이 더 이상 적절하지 않거나 불완전한 경우, 그리고 변경 사항이 합리적이고 이용자의 이익을 적절히 고려하는 경우에만 본 약관을 변경합니다.
   
본 방침의 최신 버전이 당사에 의한 귀하의 개인 데이터 처리에 적용되며 동 방침은 https://news-keeper.joon-lab.com/terms_of_use_kr.html 또는 최신 버전의 News Keeper 어플리케이션에 항상 게시됩니다.
   
법적으로 달리 요구되지 않는 한 당사는 본 약관을 변경하기 전에 이용자에게 알리고, 변경된 약관의 효력이 발생되기 최소 30일 전에 이용자에게 이를 검토할 기회를 제공합니다. 업데이트된 약관의 효력이 발생하면, 약관의 변경 발효일 이후에도 이용자가 계속 News Keeper 제품을 이용하실 경우 이용자는 변경된 약관의 적용을 받게 됩니다.
   
당사는 이용자가 당사 제품을 계속 사용하기를 희망하지만, 업데이트된 약관에 동의하지 않고 더 이상 News Keeper 커뮤니티에 참여하고 싶지 않은 경우 이용자는 언제든지 계정을 삭제할 수 있습니다.

> **계정 정지 또는 해지**

당사는 News Keeper가 사람들이 자신을 표현하고 생각과 아이디어를 공유하는 것이 환영되고 안전하다고 느끼는 공간이 되기를 바랍니다.

이용자가 특히 News Keeper의 커뮤니티 규정을 포함하여 News Keeper의 약관 또는 정책을 명백하거나 심각하게 또는 반복해서 위반하였다고 판단될 경우 이용자 계정에 대한 접근을 정지하거나 영구적으로 비활성화할 수 있습니다. 또한 이용자가 다른 사람의 지적 재산권을 반복해서 침해하였거나 법적인 이유로 필요할 경우에도 이용자의 계정을 정지하거나 비활성화할 수 있습니다.

당사가 이러한 조치를 취하는 경우, News Keeper 또는 제삼자를 법적 책임에 노출하거나, News Keeper 사용자 커뮤니티에 해를 끼치거나, News Keeper의 소스, 시스템 또는 제품의 무결성이나 운영을 손상 또는 방해하거나, 기술적 한계로 인해 제한되거나 또는 법적으로 금지되지 않은 경우에 한해 이용자가 당사의 이러한 조치에 대한 검토를 요청하는 모든 옵션을 알려드리고 설명합니다.

계정이 비활성화된 경우에 이용자가 취할 수 있는 조치와 당사가 이용자의 계정을 실수로 비활성화했다고 생각될 경우 당사에게 연락하는 방법을 알아볼 수 있습니다.

> **책임 제한**

News Keeper는 최고의 제품을 제공하는 동시에 제품을 사용하는 모든 사람에게 명확한 안내를 제공하기 위해 최선을 다합니다. 그러나 News Keeper 제품은 '있는 그대로' 제공되고, 당사는 이것이 **언제나 안전하고 보안이 유지되며 오류가 없음을 보장하지 않으며, 이것이 언제나 방해, 지연 또는 결함 없이 기능할 것이라고 보장하지 않습니다.** 관련 법률이 허용하는 한도 내에서 당사는 또한 상업성, 특정 목적을 위한 적합성, 권원 및 비침해성에 대한 묵시적 보증을 포함하되 이에 제한되지 않고 **모든 명시적이든 묵시적이든 일체의 보증을 하지 않습니다.** 당사는 사람들의 활동과 대화를 감시하거나 통제하지 않으며, (온라인이나 오프라인상에서) 사람들의 활동 또는 **사람들이 공유하는 콘텐츠(공격적이고 부적절하고 외설적이고 불법적이며 기타 반감을 일으킬만한 콘텐츠 포함)에 대해 책임을 지지 않습니다.**

당사는 News Keeper 제품에 언제 문제가 발생할지를 예측할 수 없습니다. 이에 따라 당사의 책임은 준거법이 허용하는 한도로 제한되며, 어떠한 경우에도 본 약관 또는 **News Keeper 제품과 관련하여 발생하는 이익, 수익, 정보 또는 데이터의 손실 또는 파생적, 특수적, 간접적, 모범적, 징벌적, 부수적 손해에 대해 이용자에게 책임을 지지 않습니다.** 이는 당사가 해당 손해의 가능성에 대한 권고를 받은 경우에도 해당됩니다.

단, 이에 불구하고, 관련 법률에 따라서는 위에 규정된 책임에 대한 제한이나 면제가 허용되지 않을 수 있습니다. 이 경우, News Keeper은 해당 법률이 규정하고 있는 범위 내에서 책임을 부담합니다.


> **기타**

1. 본 약관(과거 명칭: 권리 및 책임에 관한 정책)은 이용자의 News Keeper 제품 이용과 관련하여 이용자와 준랩간의 완전한 합의를 구성합니다. 본 약관은 이전의 모든 계약을 대체합니다.
2. 당사가 제공하는 일부 제품은 또한 추가 약관의 적용을 받습니다. 이용자가 해당 제품을 사용하는 경우, 추가 약관이 이용자에게 제공될 것이며 추가 약관은 당사와 이용자 간의 합의 일부를 구성합니다. 예를 들어 이용자가 상업적 또는 비즈니스(예: 광고 구매, 상품 판매, 앱 개발) 목적으로 News Keeper 제품에 접속하거나 이를 이용하는 경우 상거래 약관에 동의해야 합니다. 추가 약관이 본 약관과 충돌하는 범위에 한해 추가 약관이 우선합니다.
3. 본 약관의 일부가 집행 불능으로 판단되더라도 나머지 부분은 계속해서 효력을 갖습니다. 본 약관의 한 부분을 집행하지 못하더라도 집행의 포기로 간주하지는 않습니다. 본 약관의 개정이나 포기는 당사가 작성하고 서명한 서면을 통해서만 가능합니다.
4. 본 약관에 따른 이용자의 권리나 의무는 당사의 동의 없이 타인에게 양도할 수 없습니다.
5. 본 약관은 제삼자 수익권을 부여하지 않습니다. 본 약관에 따른 당사의 모든 권리와 의무는 인수합병이나 자산 매각과 관련하여 또는 법률이나 기타 효력에 의해 임의로 양도할 수 있습니다.
6. 특정 상황에서(예를 들어 타인이 이용자의 사용자 이름에 대한 소유를 주장하고, 해당 사용자 이름이 이용자가 일상 생활에서 사용하는 이름과 관련이 없는 것처럼 보이는 경우) 계정의 사용자 이름을 변경해야 할 수도 있습니다. 이렇게 해야 하는 경우 미리 알려드리고 이유를 설명해드립니다.
7. 당사는 News Keeper 제품 및 서비스에 대한 의견 및 제안을 언제든 환영합니다. 그러나 당사는 이를 어떠한 제한 또는 보상 의무 없이 활용할 수 있고 이를 기밀로 유지할 의무가 없음을 알려 드립니다.
8. 당사는 이용자에게 명시적으로 부여된 권한을 제외한 모든 권한을 보유합니다.

공지 일자: 2020년 11월 23일
적용 일자: 2020년 11월 23일
`